tonyrang/dsp_study/03-firmware/TMS320F28075/adc_ex1_soc_software/device/driverlib/pin_map.h
#define GPIO_42_GPIO42                   0x00461400U
#define GPIO_42_SDAA                     0x00461406U
#define GPIO_42_SCITXDA                  0x0046140FU

#define GPIO_43_GPIO43                   0x00461600U
#define GPIO_43_SCLA                     0x00461606U
#define GPIO_43_SCIRXDA                  0x0046160FU

#define GPIO_44_GPIO44                   0x00461800U
#define GPIO_44_EM1A4                    0x00461802U
#define GPIO_44_IXRCV                    0x0046180FU

#define GPIO_45_GPIO45                   0x00461A00U
#define GPIO_45_EM1A5                    0x00461A02U
#define GPIO_45_IDM                      0x00461A0FU

#define GPIO_46_GPIO46                   0x00461C00U
#define GPIO_46_EM1A6                    0x00461C02U
#define GPIO_46_SCIRXDD                  0x00461C06U
#define GPIO_46_IDP                      0x00461C0FU

#define GPIO_47_GPIO47                   0x00461E00U
#define GPIO_47_EM1A7                    0x00461E02U
#define GPIO_47_SCITXDD                  0x00461E06U
#define GPIO_47_OFSD_1_N                 0x00461E0FU

#define GPIO_48_GPIO48                   0x00480000U
#define GPIO_48_OUTPUTXBAR3              0x00480001U
#define GPIO_48_EM1A8                    0x00480002U
#define GPIO_48_SCITXDA                  0x00480006U
#define GPIO_48_SD1_D1                   0x00480007U

#define GPIO_49_GPIO49                   0x00480200U
#define GPIO_49_OUTPUTXBAR4              0x00480201U
#define GPIO_49_EM1A9                    0x00480202U
#define GPIO_49_SCIRXDA                  0x00480206U
#define GPIO_49_SD1_C1                   0x00480207U

#define GPIO_50_GPIO50                   0x00480400U
#define GPIO_50_EQEP1A                   0x00480401U
#define GPIO_50_EM1A10                   0x00480402U
#define GPIO_50_SPISIMOC                 0x00480406U
#define GPIO_50_SD1_D2                   0x00480407U

#define GPIO_51_GPIO51                   0x00480600U
#define GPIO_51_EQEP1B                   0x00480601U
#define GPIO_51_EM1A11                   0x00480602U
#define GPIO_51_SPISOMIC                 0x00480606U
#define GPIO_51_SD1_C2                   0x00480607U

#define GPIO_52_GPIO52                   0x00480800U
#define GPIO_52_EQEP1S                   0x00480801U
#define GPIO_52_EM1A12                   0x00480802U
#define GPIO_52_SPICLKC                  0x00480806U
#define GPIO_52_SD1_D3                   0x00480807U

#define GPIO_53_GPIO53                   0x00480A00U
#define GPIO_53_EQEP1I                   0x00480A01U
#define GPIO_53_EM1D31                   0x00480A02U
#define GPIO_53_SPISTEC                  0x00480A06U
#define GPIO_53_SD1_C3                   0x00480A07U

#define GPIO_54_GPIO54                   0x00480C00U
#define GPIO_54_SPISIMOA                 0x00480C01U
#define GPIO_54_EM1D30                   0x00480C02U
#define GPIO_54_EQEP2A                   0x00480C05U
#define GPIO_54_SCITXDB                  0x00480C06U
#define GPIO_54_SD1_D4                   0x00480C07U

#define GPIO_55_GPIO55                   0x00480E00U
#define GPIO_55_SPISOMIA                 0x00480E01U
#define GPIO_55_EM1D29                   0x00480E02U
#define GPIO_55_EQEP2B                   0x00480E05U
#define GPIO_55_SCIRXDB                  0x00480E06U
#define GPIO_55_SD1_C4                   0x00480E07U

#define GPIO_56_GPIO56                   0x00481000U
#define GPIO_56_SPICLKA                  0x00481001U
#define GPIO_56_EM1D28                   0x00481002U
#define GPIO_56_EQEP2S                   0x00481005U
#define GPIO_56_SCITXDC                  0x00481006U
#define GPIO_56_SD2_D1                   0x00481007U

#define GPIO_57_GPIO57                   0x00481200U
#define GPIO_57_SPISTEA                  0x00481201U
#define GPIO_57_EM1D27                   0x00481202U
#define GPIO_57_EQEP2I                   0x00481205U
#define GPIO_57_SCIRXDC                  0x00481206U
#define GPIO_57_SD2_C1                   0x00481207U

#define GPIO_58_GPIO58                   0x00481400U
#define GPIO_58_MCLKRA                   0x00481401U
#define GPIO_58_EM1D26                   0x00481402U
#define GPIO_58_OUTPUTXBAR1              0x00481405U
#define GPIO_58_SPICLKB                  0x00481406U
#define GPIO_58_SD2_D2                   0x00481407U
#define GPIO_58_SPISIMOA                 0x0048140FU

#define GPIO_59_GPIO59                   0x00481600U
#define GPIO_59_MFSRA                    0x00481601U
#define GPIO_59_EM1D25                   0x00481602U
#define GPIO_59_OUTPUTXBAR2              0x00481605U
#define GPIO_59_SPISTEB                  0x00481606U
#define GPIO_59_SD2_C2                   0x00481607U
#define GPIO_59_SPISOMIA                 0x0048160FU

#define GPIO_60_GPIO60                   0x00481800U
#define GPIO_60_MCLKRB                   0x00481801U
#define GPIO_60_EM1D24                   0x00481802U
#define GPIO_60_OUTPUTXBAR3              0x00481805U
#define GPIO_60_SPISIMOB                 0x00481806U
#define GPIO_60_SD2_D3                   0x00481807U
#define GPIO_60_SPICLKA                  0x0048180FU

#define GPIO_61_GPIO61                   0x00481A00U
#define GPIO_61_MFSRB                    0x00481A01U
#define GPIO_61_EM1D23                   0x00481A02U
#define GPIO_61_OUTPUTXBAR4              0x00481A05U
#define GPIO_61_SPISOMIB                 0x00481A06U
#define GPIO_61_SD2_C3                   0x00481A07U
#define GPIO_61_SPISTEA                  0x00481A0FU

#define GPIO_62_GPIO62                   0x00481C00U
#define GPIO_62_SCIRXDC                  0x00481C01U
#define GPIO_62_EM1D22                   0x00481C02U
#define GPIO_62_EQEP3A                   0x00481C05U
#define GPIO_62_CANRXA                   0x00481C06U
#define GPIO_62_SD2_D4                   0x00481C07U

#define GPIO_63_GPIO63                   0x00481E00U
#define GPIO_63_SCITXDC                  0x00481E01U
#define GPIO_63_EM1D21                   0x00481E02U
#define GPIO_63_EQEP3B                   0x00481E05U
#define GPIO_63_CANTXA                   0x00481E06U
#define GPIO_63_SD2_C4                   0x00481E07U
#define GPIO_63_SPISIMOB                 0x00481E0FU

