tonyrang/dsp_study/03-firmware/TMS320F28075/adc_ex1_soc_software/device/driverlib/pin_map.h
#define GPIO_64_GPIO64                   0x00860000U
#define GPIO_64_EM1D20                   0x00860002U
#define GPIO_64_EQEP3S                   0x00860005U
#define GPIO_64_SCIRXDA                  0x00860006U
#define GPIO_64_SPISOMIB                 0x0086000FU

#define GPIO_65_GPIO65                   0x00860200U
#define GPIO_65_EM1D19                   0x00860202U
#define GPIO_65_EQEP3I                   0x00860205U
#define GPIO_65_SCITXDA                  0x00860206U
#define GPIO_65_SPICLKB                  0x0086020FU

#define GPIO_66_GPIO66                   0x00860400U
#define GPIO_66_EM1D18                   0x00860402U
#define GPIO_66_SDAB                     0x00860406U
#define GPIO_66_SPISTEB                  0x0086040FU

#define GPIO_67_GPIO67                   0x00860600U
#define GPIO_67_EM1D17                   0x00860602U

#define GPIO_68_GPIO68                   0x00860800U
#define GPIO_68_EM1D16                   0x00860802U

#define GPIO_69_GPIO69                   0x00860A00U
#define GPIO_69_EM1D15                   0x00860A02U
#define GPIO_69_EMU0                     0x00860A03U
#define GPIO_69_SCLB                     0x00860A06U
#define GPIO_69_SPISIMOC                 0x00860A0FU

#define GPIO_70_GPIO70                   0x00860C00U
#define GPIO_70_EM1D14                   0x00860C02U
#define GPIO_70_EMU0                     0x00860C03U
#define GPIO_70_CANRXA                   0x00860C05U
#define GPIO_70_SCITXDB                  0x00860C06U
#define GPIO_70_SPISOMIC                 0x00860C0FU

#define GPIO_71_GPIO71                   0x00860E00U
#define GPIO_71_EM1D13                   0x00860E02U
#define GPIO_71_EMU1                     0x00860E03U
#define GPIO_71_CANTXA                   0x00860E05U
#define GPIO_71_SCIRXDB                  0x00860E06U
#define GPIO_71_SPICLKC                  0x00860E0FU

#define GPIO_72_GPIO72                   0x00861000U
#define GPIO_72_EM1D12                   0x00861002U
#define GPIO_72_CANTXB                   0x00861005U
#define GPIO_72_SCITXDC                  0x00861006U
#define GPIO_72_SPISTEC                  0x0086100FU

#define GPIO_73_GPIO73                   0x00861200U
#define GPIO_73_EM1D11                   0x00861202U
#define GPIO_73_XCLKOUT                  0x00861203U
#define GPIO_73_CANRXB                   0x00861205U
#define GPIO_73_SCIRXDC                  0x00861206U

#define GPIO_74_GPIO74                   0x00861400U
#define GPIO_74_EM1D10                   0x00861402U

#define GPIO_75_GPIO75                   0x00861600U
#define GPIO_75_EM1D9                    0x00861602U

#define GPIO_76_GPIO76                   0x00861800U
#define GPIO_76_EM1D8                    0x00861802U
#define GPIO_76_SCITXDD                  0x00861806U

#define GPIO_77_GPIO77                   0x00861A00U
#define GPIO_77_EM1D7                    0x00861A02U
#define GPIO_77_SCIRXDD                  0x00861A06U

#define GPIO_78_GPIO78                   0x00861C00U
#define GPIO_78_EM1D6                    0x00861C02U
#define GPIO_78_EQEP2A                   0x00861C06U

#define GPIO_79_GPIO79                   0x00861E00U
#define GPIO_79_EM1D5                    0x00861E02U
#define GPIO_79_EQEP2B                   0x00861E06U

#define GPIO_80_GPIO80                   0x00880000U
#define GPIO_80_EM1D4                    0x00880002U
#define GPIO_80_EQEP2S                   0x00880006U

#define GPIO_81_GPIO81                   0x00880200U
#define GPIO_81_EM1D3                    0x00880202U
#define GPIO_81_EQEP2I                   0x00880206U

#define GPIO_82_GPIO82                   0x00880400U
#define GPIO_82_EM1D2                    0x00880402U

#define GPIO_83_GPIO83                   0x00880600U
#define GPIO_83_EM1D1                    0x00880602U

#define GPIO_84_GPIO84                   0x00880800U
#define GPIO_84_SCITXDA                  0x00880805U
#define GPIO_84_MDXB                     0x00880806U
#define GPIO_84_MDXA                     0x0088080FU

#define GPIO_85_GPIO85                   0x00880A00U
#define GPIO_85_EM1D0                    0x00880A02U
#define GPIO_85_SCIRXDA                  0x00880A05U
#define GPIO_85_MDRB                     0x00880A06U
#define GPIO_85_MDRA                     0x00880A0FU

#define GPIO_86_GPIO86                   0x00880C00U
#define GPIO_86_EM1A13                   0x00880C02U
#define GPIO_86_EM1CAS                   0x00880C03U
#define GPIO_86_SCITXDB                  0x00880C05U
#define GPIO_86_MCLKXB                   0x00880C06U
#define GPIO_86_MCLKXA                   0x00880C0FU

#define GPIO_87_GPIO87                   0x00880E00U
#define GPIO_87_EM1A14                   0x00880E02U
#define GPIO_87_EM1RAS                   0x00880E03U
#define GPIO_87_SCIRXDB                  0x00880E05U
#define GPIO_87_MFSXB                    0x00880E06U
#define GPIO_87_MFSXA                    0x00880E0FU

#define GPIO_88_GPIO88                   0x00881000U
#define GPIO_88_EM1A15                   0x00881002U
#define GPIO_88_EM1DQM0                  0x00881003U

#define GPIO_89_GPIO89                   0x00881200U
#define GPIO_89_EM1A16                   0x00881202U
#define GPIO_89_EM1DQM1                  0x00881203U
#define GPIO_89_SCITXDC                  0x00881206U

#define GPIO_90_GPIO90                   0x00881400U
#define GPIO_90_EM1A17                   0x00881402U
#define GPIO_90_EM1DQM2                  0x00881403U
#define GPIO_90_SCIRXDC                  0x00881406U

#define GPIO_91_GPIO91                   0x00881600U
#define GPIO_91_EM1A18                   0x00881602U
#define GPIO_91_EM1DQM3                  0x00881603U
#define GPIO_91_SDAA                     0x00881606U

#define GPIO_92_GPIO92                   0x00881800U
#define GPIO_92_EM1A19                   0x00881802U
#define GPIO_92_EM1BA1                   0x00881803U
#define GPIO_92_SCLA                     0x00881806U

#define GPIO_93_GPIO93                   0x00881A00U
#define GPIO_93_EM1A20                   0x00881A02U
#define GPIO_93_EM1BA0                   0x00881A03U
#define GPIO_93_SCITXDD                  0x00881A06U

#define GPIO_94_GPIO94                   0x00881C00U
#define GPIO_94_EM1A21                   0x00881C02U
#define GPIO_94_SCIRXDD                  0x00881C06U

#define GPIO_99_GPIO99                   0x00C60600U
#define GPIO_99_EQEP1I                   0x00C60605U

#define GPIO_133_GPIO133                  0x01060A00U
#define GPIO_133_SD2_C2                   0x01060A07U
#define GPIO_133_ODPDAT                   0x01060A0FU

//*****************************************************************************
// Legacy pinmuxing MACROS - Retained for portability across devices ONLY      
// Not recommended for new users                                               
//*****************************************************************************

#define GPIO_16_SD_D1                   GPIO_16_SD1_D1

#define GPIO_17_SD_C1                   GPIO_17_SD1_C1

#define GPIO_18_SD_D2                   GPIO_18_SD1_D2

#define GPIO_19_SD_C2                   GPIO_19_SD1_C2

#define GPIO_20_SD_D3                   GPIO_20_SD1_D3

#define GPIO_21_SD_C3                   GPIO_21_SD1_C3

#define GPIO_22_SD_D4                   GPIO_22_SD1_D4

#define GPIO_23_SD_C4                   GPIO_23_SD1_C4

#define GPIO_24_SD_D5                   GPIO_24_SD2_D1

#define GPIO_25_SD_C5                   GPIO_25_SD2_C1

#define GPIO_26_SD_D6                   GPIO_26_SD2_D2

#define GPIO_27_SD_C6                   GPIO_27_SD2_C2

#define GPIO_28_SD_D7                   GPIO_28_SD2_D3

#define GPIO_29_SD_C7                   GPIO_29_SD2_C3

#define GPIO_30_SD_D8                   GPIO_30_SD2_D4

#define GPIO_31_SD_C8                   GPIO_31_SD2_C4

#define GPIO_36_EM1WAIT1                GPIO_36_EM1WAIT

#endif // __PIN_MAP_H__                                                        
